tap "daipeihust/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "oven-sh/bun"
tap "wez/wezterm"
brew "act"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "bat"
brew "biome"
brew "glib"
brew "chezmoi"
brew "csview"
brew "deno"
brew "docker", link: false
brew "dua-cli"
brew "eza"
brew "fd"
brew "fdupes"
brew "fish"
brew "fzf"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "ghq"
brew "git-delta"
brew "git-lfs"
brew "gitui"
brew "go"
brew "harfbuzz"
brew "helix"
brew "hey"
brew "hyperfine"
brew "jq"
brew "just"
brew "krb5"
brew "libomp"
brew "libpq", link: true
brew "pango"
brew "librsvg"
brew "llvm"
brew "luajit"
brew "navi"
brew "neovim"
brew "netpbm"
brew "openjdk@11"
brew "procs"
brew "qemu"
brew "qt"
brew "rdfind"
brew "ripgrep"
brew "rustup-init"
brew "shellharden"
brew "starship"
brew "tealdeer"
brew "trash-cli"
brew "tree"
brew "vim"
brew "volta"
brew "zellij"
brew "zoxide"
brew "daipeihust/tap/im-select"
brew "oven-sh/bun/bun"
cask "activitywatch"
cask "affine"
cask "alt-tab"
cask "bluesnooze"
cask "cleanshot"
cask "clipy"
cask "discord"
cask "docker"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "google-cloud-sdk"
cask "google-drive"
cask "google-japanese-ime"
cask "hiddenbar"
cask "meetingbar"
cask "notion"
cask "orbstack"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "tableplus"
cask "timing"
cask "todoist"
cask "visual-studio-code"
cask "wezterm"
cask "zed"
cask "zoom"
