# Homebrew Taps
tap "daipeihust/tap"               # Custom repository for specific tools not in the main Homebrew repository.
tap "homebrew/bundle"              # Homebrew extension for managing Brewfile to specify project dependencies.
tap "homebrew/cask-fonts"          # Repository for installing fonts.
tap "homebrew/services"            # Homebrew services integration for starting Homebrew-installed services.
tap "koekeishiya/formulae"         # Repository for 'yabai' and 'skhd', window management tools.
tap "wez/wezterm"                  # Repository for WezTerm, a GPU-accelerated terminal emulator.

# Essential Tools and Libraries
brew "webp"                        # Tool for the WebP image format, providing lossless and lossy compression.
brew "jpeg-xl"                     # Image format providing high compression efficiency.
brew "aom"                         # Open-source codec for AV1 video streams.
brew "bat"                         # A clone of 'cat' with syntax highlighting and Git integration.
brew "biome"                       # The web toolchain.
brew "glib"                        # Low-level core library that forms the basis for projects such as GTK+ and GNOME.
brew "chezmoi"                     # Tool to manage dotfiles securely across multiple machines.
brew "csview"                      # CSV file viewer for the command line.
brew "docker", link: false         # Platform for developing, shipping, and running applications in containers.
brew "dua-cli"                     # Disk usage analyzer with an interactive CLI.
brew "eza"                         # Not widely known; potentially a specific or custom utility.
brew "fd"                          # Simple, fast alternative to 'find'.
brew "fdupes"                      # Utility for identifying and deleting duplicate files.
brew "fish"                        # Friendly interactive shell.
brew "fzf"                         # Command-line fuzzy finder.
brew "gd"                          # Library for dynamic image creation.
brew "gdk-pixbuf"                  # Toolkit for image loading and pixel buffer manipulation.
brew "gh"                          # GitHub CLI to manage GitHub from the command line.
brew "ghq"                         # Remote repository management tool.
brew "git-delta"                   # Syntax-highlighter for git and diff output.
brew "git-lfs"                     # Git extension for versioning large files.
brew "gitui"                       # Blazing fast terminal-ui for git.

# Programming Languages
brew "go"                          # The Go programming language.
brew "deno"                        # A secure runtime for JavaScript and TypeScript.
brew "oven-sh/bun/bun"             # JavaScript runtime, bundler, transpiler and package manager.

# Tools
brew "harfbuzz"                    # Open source text shaping library.
brew "hey"                         # Tool for HTTP load generation.
brew "hyperfine"                   # Command-line benchmarking tool.
brew "jq"                          # Lightweight and flexible command-line JSON processor.
brew "just"                        # Handy way to save and run project-specific commands.
brew "krb5"                        # Implementation of the Kerberos network authentication protocol.
brew "libomp"                      # LLVM's OpenMP runtime library.
brew "pango"                       # Library for layout and rendering of text.
brew "llvm"                        # Collection of modular and reusable compiler and toolchain technologies.
brew "luajit"                      # Just-In-Time Compiler for the Lua programming language.
brew "navi"                        # An interactive cheatsheet tool for the command-line.
brew "procs"                       # Modern replacement for 'ps'.
brew "qemu"                        # Generic and open source machine emulator and virtualizer.
brew "qt"                          # Cross-platform application framework.
brew "rdfind"                      # Tool to find duplicate files.
brew "ripgrep"                     # Line-oriented search tool that recursively searches for a regex pattern.
brew "rustup-init"                 # Installer for the systems programming language Rust.
brew "shellharden"                 # Shell script linter.
brew "starship"                    # Minimal, blazing-fast, and infinitely customizable prompt for any shell.
brew "tealdeer"                    # Fast tldr client.
brew "trash-cli"                   # Command-line interface to the system trash.
brew "tree"                        # Recursive directory listing command that produces a depth-indented listing of files.
brew "volta"                       # JavaScript tool manager.
brew "zellij"                      # Terminal workspace and multiplexer.
brew "zoxide"                      # Faster way to navigate your filesystem.
brew "daipeihust/tap/im-select"    # Utility to switch input methods.

cask "google-cloud-sdk"
cask "orbstack"

# Font
cask "font-fira-code"
cask "font-hack-nerd-font"

# Creativity
cask "affine"
cask "notion"

# Productivity
cask "raycast"
cask "rectangle"
cask "google-drive"
cask "meetingbar"

# Work
cask "slack"
cask "discord"
cask "todoist"
cask "zoom"
cask "alt-tab"
cask "bluesnooze"
cask "clipy"

# Editor
brew "vim"
brew "neovim"
cask "visual-studio-code"
cask "zed"

# Dev
cask "wezterm"
cask "tableplus"
cask "spotify"
cask "timing"