tap "2mol/tools"
tap "daipeihust/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "kowainik/tap"
tap "tako8ki/tap"
tap "wez/wezterm"
brew "bat"
brew "bitwarden-cli"
brew "glib"
brew "chezmoi"
brew "csview"
brew "deno", link: false
brew "docker", link: false
brew "exa"
brew "fd"
brew "fish"
brew "fzf"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "ghq"
brew "git-lfs"
brew "gitui"
brew "gobject-introspection"
brew "netpbm"
brew "harfbuzz"
brew "hey"
brew "hyperfine"
brew "jq"
brew "krb5"
brew "libomp"
brew "libpq", link: true
brew "pango"
brew "librsvg"
brew "luajit"
brew "navi"
brew "neovim"
brew "pnpm"
brew "procs"
brew "q"
brew "qt"
brew "ripgrep"
brew "shellharden"
brew "spotify-tui"
brew "starship"
brew "tealdeer"
brew "trash-cli"
brew "tree"
brew "vifm"
brew "vim"
brew "youtube-dl"
brew "zoxide"
brew "2mol/tools/pboy"
brew "daipeihust/tap/im-select"
brew "heroku/brew/heroku"
brew "tako8ki/tap/gobang"
cask "activitywatch"
cask "alfred"
cask "alt-tab"
cask "arctype"
cask "bluesnooze"
cask "clipy"
cask "contexts"
cask "discord"
cask "docker"
cask "fig"
cask "font-hack-nerd-font"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "google-japanese-ime"
cask "iterm2"
cask "kindle"
cask "slack"
cask "spectacle"
cask "spotify"
cask "tableplus"
cask "visual-studio-code"
cask "vivaldi"
cask "wezterm"
